'''Во время контрольной работы профессор заметил, что некоторые студенты обмениваются записками. Сначала он хотел поставить им всем двойки, но в тот день профессор был добрым, а потому решил разделить студентов на две группы: списывающих и дающих списывать, и поставить двойки только первым. У профессора записаны все пары студентов, обменявшихся записками. Требуется определить, сможет ли он разделить студентов на две группы так, чтобы любой обмен записками осуществлялся от студента одной группы студенту другой группы.

Формат входных данных
В первой строке входного файла записаны два числа N и M - количество студентов и количество пар студентов, обменивающихся записками (1≤N≤1000, 0≤M≤20000). Далее в M строках расположены описания пар студентов: два числа, соответствующие номерам студентов, обменивающихся записками (нумерация студентов идёт с 0). Каждая пара студентов перечислена не более одного раза.

Формат выходных данных
Необходимо вывести ответ на задачу профессора. Если возможно разделить студентов на две группы - выведите номера вершин любой из этих групп(тех кому профессор поставит двойки =)) в одной строке через пробел, иначе выведите NO.'''

